In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:
genre_csv_file = "genre/clean_movie_genre_dt.csv"
movie_genre_df = pd.read_csv(genre_csv_file)
movie_genre_df.head()

                                            title      genre  year
0                                     The Shining      Drama  1980
1                                 The Blue Lagoon  Adventure  1980
2  Star Wars: Episode V - The Empire Strikes Back     Action  1980
3                                       Airplane!     Comedy  1980
4                                      Caddyshack     Comedy  1980

In [5]:
artist_csv_file = "artist/artist.csv"
artist_df = pd.read_csv(artist_csv_file)
artist_df.head()

   artist_id           artist                                  imdb_id
0  nm0000001     Fred Astaire  tt0031983,tt0050419,tt0053137,tt0072308
1  nm0000002    Lauren Bacall  tt0117057,tt0038355,tt0071877,tt0037382
2  nm0000003  Brigitte Bardot  tt0054452,tt0057345,tt0049189,tt0056404
3  nm0000004     John Belushi  tt0078723,tt0077975,tt0080455,tt0072562
4  nm0000005   Ingmar Bergman  tt0050986,tt0050976,tt0083922,tt0060827

In [6]:
revenue_csv_file = "revenue/revenue.csv"
revenue_df = pd.read_csv(revenue_csv_file)
revenue_df.head()

        title   type                       country worldwide_gross
0   Grown Ups  Movie                 United States   $272,223,430
1  Dark Skies  Movie                 United States    $27,704,111
2    Paranoia  Movie  United States, India, France    $16,173,593
3        Jaws  Movie                 United States   $470,700,000
4      Jaws 2  Movie                 United States   $208,900,376

In [14]:
budget_csv_file = "budget_and _votes/resources/movie_budget_clean.csv"
budget_df = pd.read_csv(budget_csv_file, names=["tdmb_id", "idmb_id", "title", "budget", "revenue"])
budget_df.head()

   tdmb_id     idmb_id                              title    budget  revenue
0        5   tt0113101                         Four Rooms   4000000       74
1        8   tt0825671   Life in Loops (A Megacities RMX)     42000       98
2       12   tt0266543                       Finding Nemo  94000000        0
3       13   tt0109830                       Forrest Gump  55000000       80
4       14   tt0169547                    American Beauty  15000000        0

In [8]:
votes_csv_file = "budget_and _votes/resources/movie_votes_clean.csv"
votes_df = pd.read_csv(votes_csv_file)
votes_df.head()

   tdmb_id     idmb_id  popularity  vote_average
0      2.0   tt0094675      10.636           6.8
1      3.0   tt0092149       8.329           7.2
2      5.0   tt0113101      20.880           5.7
3      6.0   tt0107286       9.596           6.5
4      8.0   tt0825671       2.628           7.5

In [ ]:
rds_connection_string = "postgres:Newchicoemo7$@localhost:5432/Film_reseach_project_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [ ]:
engine.table_names()

In [ ]:
movie_genre_df.to_sql(name='genre', con=engine, if_exists='append', index=False)

In [ ]:
artist_df.to_sql(name='artist', con=engine, if_exists='append', index=True)

In [ ]:
revenue_df.to_sql(name='revenue', con=engine, if_exists='append', index=True)

In [ ]:
budget_df.to_sql(name='movie_budget', con=engine, if_exists='append', index=True)

In [ ]:
votes_df.to_sql(name='movie_votes', con=engine, if_exists='append', index=True)